tutorials/incompressible/adjointOptimisationFoam/shapeOptimisation/motorBike/constant/adjointRASProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

adjointRASModel   adjointSpalartAllmaras;

adjointSpalartAllmarasCoeffs
{
    nSmooth           1;
    zeroATCPatchTypes (wall patch);
    maskType          pointCells;
}

adjointTurbulence on;

printCoeffs       off;


// ************************************************************************* //
